app/views/projects/show.html.erb

<p>Owner: <%= @project.owner.name %></p>
<p>Members: <%= @project.users.map(&:name).join(', ') %></p>
---
SELECT "users".* FROM "users" INNER JOIN "project_memberships" ON "users"."id" = "project_memberships"."user_id" WHERE "project_memberships"."project_id" = ?  [["project_id", 1]]