app/controllers/projects_controller.rb

  def show
    @attachments = @project.attachments.includes(file_attachment: :blob)
    @project_threads = @project.project_threads.order(created_at: :desc)
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."project_id" = ?  [["project_id", 1]]
SELECT "project_threads".* FROM "project_threads" WHERE "project_threads"."project_id" = ? ORDER BY "project_threads"."created_at" DESC  [["project_id", 1]]

  def create
    @project = current_user.owned_projects.build(project_params)
    if @project.save
      @project.project_memberships.create(user: current_user, admin: true)
---
INSERT INTO "projects" ("title", "description", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "software"], ["description", "i am a software developer "], ["owner_id", 1], ["created_at", "2026-03-27 14:06:25.482820"], ["updated_at", "2026-03-27 14:06:25.482820"]]
INSERT INTO "project_memberships" ("user_id", "project_id", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["project_id", 1], ["admin", 1], ["created_at", "2026-03-27 14:06:25.600982"], ["updated_at", "2026-03-27 14:06:25.600982"]]